УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Партнеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Партнеры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеизвестныйПартнер</name>
      <description>Неизвестный партнер</description>
    </items>
  </predefined>
  <attributes>
    <name>БизнесРегион</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРегистрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Конкурент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПрочиеОтношения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбслуживаетсяТорговымиПредставителями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантОтправкиЭлектронногоЧека</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КонтакнаяИнформацияПартнераАнгл</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартОсновнойМенеджерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартДилерСервисЦентра</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Перепродавец</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерАдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерКонтактноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерТелефонКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>смартПартнерПропускнаяСистема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерДополнительнаяОбработкаГрузаТранспортнойКомпанией</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерСпособДоставкиТовара</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>смартПартнерПлатильщикЗаДоставкуГруза</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="431ea12d-0bcd-44da-8c13-8fd3e3e1a591">
    <name>смартДилерБывший</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8d8288f2-9450-4c32-b3b2-af0cc494cf90">
    <name>смартКлючевойКлиентПоРасходнымМатериалам</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартОборудованиеКлиентов</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартНаименованиеОборудования</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартОборудованиеКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>смартЧернилаКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>смартЧернилаКлиента</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>смартКомментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>смартДатаДобавления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="a039b99d-5c3e-46bf-b321-17891d574d3e">
    <name>смартВидыДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="b5fe9406-a0b5-49eb-9e30-99dd19a7a18b">
      <name>ВидДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c9650fb8-3e0f-4ca1-b198-3b3d9b8f018c">
    <name>смартТипичноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="082a786c-a92a-457f-bce6-eb2074d564f5">
      <name>ТипичноеОборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Партнеры/Forms/смарт_ФормаРедактированияВидовДеятельности/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.ТекущийПартнер = Параметры.Партнер;
	
	//++ #Б-7322 смарт: Фролов 06.07.2026 //Справочник "Партнеры". Таблица "Виды деятельности". Добавить реквизиты.
	ТабВходящихДанных = Новый ТаблицаЗначений;
	ТабВходящихДанных.Колонки.Добавить("ВидДеятельности");
	ТабВходящихДанных.Колонки.Добавить("УстановленМенеджером");
	ТабВходящихДанных.Колонки.Добавить("УстановленИИ");
	ТабВходящихДанных.Колонки.Добавить("ОбоснованиеВыбораИИ");
	
	Для Каждого Стр Из Параметры.МассивВидовДеятельности Цикл
		
		СтрТабВходящихДанных = ТабВходящихДанных.Добавить();
		СтрТабВходящихДанных.ВидДеятельности = Стр.ВидДеятельности;
		СтрТабВходящихДанных.УстановленМенеджером = Стр.УстановленМенеджером;
		СтрТабВходящихДанных.УстановленИИ = Стр.УстановленИИ;
		СтрТабВходящихДанных.ОбоснованиеВыбораИИ = Стр.ОбоснованиеВыбораИИ;
		
	КонецЦикла;
	//-- #Б-7322 смарт: Фролов 06.07.2026
	
	МассивТипичноеОборудование = Параметры.МассивТипичноеОборудование;
	МассивНаших = Параметры.МассивНаших;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	смартВидыДеятельностиПартнера.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.смартВидыДеятельностиПартнера КАК смартВидыДеятельностиПартнера
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартТипичноеОборудование.Ссылка КАК ТипичноеОборудование
	|ИЗ
	|	Справочник.смартТипичноеОборудование КАК смартТипичноеОборудование");
	Запрос.УстановитьПараметр("Партнер", ТекущийПартнер); 
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаВД = МассивРезультатов[0].Выбрать();
	ВыборкаТО = МассивРезультатов[1].Выбрать();
	
	Пока ВыборкаВД.Следующий() Цикл 
		
		//++ #Б-7322 смарт: Фролов 06.07.2026 //Справочник "Партнеры". Таблица "Виды деятельности". Добавить реквизиты.
		СтрВидыДеятельности = ВидыДеятельности.Добавить();
		СтрВидыДеятельности.ВидДеятельности = ВыборкаВД.Ссылка;
		
		СтрокаТабВходящихДанных = ТабВходящихДанных.Найти(ВыборкаВД.Ссылка, "ВидДеятельности");
		Если НЕ СтрокаТабВходящихДанных = Неопределено Тогда
			
			СтрВидыДеятельности.Пометка = Истина;
			СтрВидыДеятельности.УстановленМенеджером = СтрокаТабВходящихДанных.УстановленМенеджером;
			СтрВидыДеятельности.УстановленИИ = СтрокаТабВходящихДанных.УстановленИИ;
			СтрВидыДеятельности.ОбоснованиеВыбораИИ = СтрокаТабВходящихДанных.ОбоснованиеВыбораИИ;
			
		КонецЕсли;	
		//ВидыДеятельности.Добавить(ВыборкаВД.Ссылка, , ?(МассивВидовДеятельности.Найти(ВыборкаВД.Ссылка) = Неопределено, Ложь, Истина));
		//-- #Б-7322 смарт: Фролов 06.07.2026
		
	КонецЦикла;
	
	Пока ВыборкаТО.Следующий() Цикл
		
		СтрТипичноеОборудование = ТипичноеОборудование.Добавить();
		ЗаполнитьЗначенияСвойств(СтрТипичноеОборудование, ВыборкаТО);
		
		Если НЕ МассивТипичноеОборудование.Найти(ВыборкаТО.ТипичноеОборудование) = Неопределено Тогда
			СтрТипичноеОборудование.Пометка = Истина;	
		КонецЕсли;
		
		Если НЕ МассивНаших.Найти(ВыборкаТО.ТипичноеОборудование) = Неопределено Тогда
			СтрТипичноеОборудование.КупленоВСМАРТ = Истина;	
		КонецЕсли;	
		
	КонецЦикла;
	
	//++ #6764 смарт: Тимофеева 15.05.2026 / Внести изменения в "Форму редактирования видов деятельности" в карточке партнера 
	ВидДеятельностиДругое = Параметры.ВидДеятельностиДругоеРасшифровка.ВидДеятельности;
	ВидДеятельностиДругоеРасшифровка = Параметры.ВидДеятельностиДругоеРасшифровка.ДругоеРасшифровка;
	
	ТипичноеОборудованиеДругое = Параметры.ТипичноеОборудованиеДругоеРасшифровка.ТипичноеОборудование;
	ТипичноеОборудованиеДругоеРасшифровка = Параметры.ТипичноеОборудованиеДругоеРасшифровка.ДругоеРасшифровка;
	//-- #6764 смарт: Тимофеева 15.05.2026 

	ПометитьТипичноеОборудование();
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.ВидыДеятельности.Имя);
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВидыДеятельности.Пометка");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.Использование = Истина;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(230, 230, 250)); 
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТипичноеОборудование.Имя);
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипичноеОборудование.Пометка");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.Использование = Истина;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(230, 230, 250)); 
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТипичноеОборудованиеПометка");
	ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипичноеОборудование.Подсветка");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.Использование = Истина;
	ЭлементУсловия.ПравоеЗначение = Истина;
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", Новый Цвет(152, 251, 152));
	
КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	МассивВидовДеятельности = Новый Массив;
	
	Для Каждого СтрВидыДеятельности Из ВидыДеятельности Цикл
		
		Если СтрВидыДеятельности.Пометка Тогда 
			
			//++ #Б-7322 смарт: Фролов 06.07.2026 //Справочник "Партнеры". Таблица "Виды деятельности". Добавить реквизиты.
			СтруктураВидаДеятельность = Новый Структура("ВидДеятельности, УстановленМенеджером, УстановленИИ, ОбоснованиеВыбораИИ",
				СтрВидыДеятельности.ВидДеятельности, СтрВидыДеятельности.УстановленМенеджером, СтрВидыДеятельности.УстановленИИ, СтрВидыДеятельности.ОбоснованиеВыбораИИ);
				
			МассивВидовДеятельности.Добавить(СтруктураВидаДеятельность);	
			//МассивВидовДеятельности.Добавить(СтрВидыДеятельности.Значение);	
			//-- #Б-7322 смарт: Фролов 06.07.2026
			
			
		КонецЕсли;	
		
	КонецЦикла;
	
	МассивТипичноеОборудование = Новый Массив;
	МассивНаших = Новый Массив;
	
	Для Каждого СтрТипичноеОборудование Из ТипичноеОборудование Цикл
		
		Если СтрТипичноеОборудование.Пометка Тогда
			
			МассивТипичноеОборудование.Добавить(СтрТипичноеОборудование.ТипичноеОборудование);
			
			Если СтрТипичноеОборудование.КупленоВСМАРТ Тогда
				
				МассивНаших.Добавить(СтрТипичноеОборудование.ТипичноеОборудование);	
				
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЦикла;
	
	ПараметрыЗакрытия = Новый Структура;
	
	ПараметрыЗакрытия.Вставить("МассивВидовДеятельности", МассивВидовДеятельности);
	ПараметрыЗакрытия.Вставить("МассивТипичноеОборудование", МассивТипичноеОборудование);
	ПараметрыЗакрытия.Вставить("МассивНаших", МассивНаших);
	
	//++ #6764 смарт: Тимофеева 15.05.2026 / Внести изменения в "Форму редактирования видов деятельности" в карточке партнера 
	//++ #Б-7322 смарт: Фролов 06.07.2026 //Справочник "Партнеры". Таблица "Виды деятельности". Добавить реквизиты.
	//ВидДеятельностиДругоеСтрока = ВидыДеятельности.НайтиПоЗначению(ВидДеятельностиДругое);
	//Если НЕ ВидДеятельностиДругоеСтрока = Неопределено
	//	И ВидДеятельностиДругоеСтрока.Пометка Тогда
	СтрокиВидыДеятельности = ВидыДеятельности.НайтиСтроки(Новый Структура("ВидДеятельности", ВидДеятельностиДругое));
	Если СтрокиВидыДеятельности.Количество() > 0 И СтрокиВидыДеятельности[0].Пометка Тогда
	//-- #Б-7322 смарт: Фролов 06.07.2026	
		ВидДеятельностиДругоеСтруктура = Новый Структура;
		ВидДеятельностиДругоеСтруктура.Вставить("ВидДеятельности", ВидДеятельностиДругое);
		ВидДеятельностиДругоеСтруктура.Вставить("ДругоеРасшифровка", ВидДеятельностиДругоеРасшифровка);
		ПараметрыЗакрытия.Вставить("ВидДеятельностиДругоеРасшифровка", ВидДеятельностиДругоеСтруктура);
	КонецЕсли;
	
	ТипичноеОборудованиеДругоеСтроки = ТипичноеОборудование.НайтиСтроки(Новый Структура("ТипичноеОборудование", ТипичноеОборудованиеДругое));
	Если ТипичноеОборудованиеДругоеСтроки.Количество() > 0
		И ТипичноеОборудованиеДругоеСтроки[0].Пометка Тогда
		ТипичноеОборудованиеДругоеСтруктура = Новый Структура;
		ТипичноеОборудованиеДругоеСтруктура.Вставить("ТипичноеОборудование", ТипичноеОборудованиеДругое);
		ТипичноеОборудованиеДругоеСтруктура.Вставить("ДругоеРасшифровка", ТипичноеОборудованиеДругоеРасшифровка);
		ПараметрыЗакрытия.Вставить("ТипичноеОборудованиеДругоеРасшифровка", ТипичноеОборудованиеДругоеСтруктура);
	КонецЕсли;
	//-- #6764 смарт: Тимофеева 15.05.2026 

	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипичноеОборудованиеКупленоВСМАРТПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТипичноеОборудование.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		Если ТекущиеДанные.КупленоВСМАРТ Тогда
			
			ТекущиеДанные.Пометка = Истина;		
			
		КонецЕсли;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипичноеОборудованиеПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТипичноеОборудование.ТекущиеДанные;
	
	Если НЕ ТекущиеДанные = Неопределено Тогда
		
		Если НЕ ТекущиеДанные.Пометка Тогда
			
			ТекущиеДанные.КупленоВСМАРТ = Ложь;		
			
		КонецЕсли;	
		
		//++ #6764 смарт: Тимофеева 15.05.2026 / Внести изменения в "Форму редактирования видов деятельности" в карточке партнера 
		Элементы.ДругоеРасшифровкаТипичногоОборудования.Видимость = ТекущиеДанные.ТипичноеОборудование = ТипичноеОборудованиеДругое И ТекущиеДанные.Пометка;		
		//-- #6764 смарт: Тимофеева 15.05.2026

	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПометитьТипичноеОборудование()

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Оборудование КАК Оборудование
	|ИЗ
	|	Справочник.смартВидыДеятельностиПартнера.ТипичноеОборудование
	|ГДЕ
	|	Ссылка В(&ВидыДеятельности)");
	
	МассивВидовДеятельности = Новый Массив;
	Для Каждого СтрВидыДеятельности Из ВидыДеятельности Цикл
		
		Если СтрВидыДеятельности.Пометка Тогда
			
			//++ #Б-7322 смарт: Фролов 06.07.2026 //Справочник "Партнеры". Таблица "Виды деятельности". Добавить реквизиты.
			//МассивВидовДеятельности.Добавить(СтрВидыДеятельности.Значение);
			МассивВидовДеятельности.Добавить(СтрВидыДеятельности.ВидДеятельности);
			//-- #Б-7322 смарт: Фролов 06.07.2026
			
		КонецЕсли;	
			
	КонецЦикла;	
	Запрос.УстановитьПараметр("ВидыДеятельности", МассивВидовДеятельности);
	
	МассивОборудования = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Оборудование");
	
	Для Каждого СтрТипичноеОборудование из ТипичноеОборудование Цикл
		
		Если МассивОборудования.Найти(СтрТипичноеОборудование.ТипичноеОборудование) = Неопределено Тогда
			
			СтрТипичноеОборудование.Подсветка = Ложь;	
			
		Иначе
			
			СтрТипичноеОборудование.Подсветка = Истина;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ВидыДеятельностиПометкаПриИзменении(Элемент)
	
	ПометитьТипичноеОборудование();
	
	//++ #Б-7322 смарт: Фролов 06.07.2026 //Справочник "Партнеры". Таблица "Виды деятельности". Добавить реквизиты.
	ТекущиеДанные = Элементы.ВидыДеятельности.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ТекущиеДанные.УстановленМенеджером = ТекущиеДанные.Пометка;
	КонецЕсли;
	//-- #Б-7322 смарт: Фролов 06.07.2026
	
КонецПроцедуры

//++ #6764 смарт: Тимофеева 15.05.2026 / Внести изменения в "Форму редактирования видов деятельности" в карточке партнера 
&НаКлиенте
Процедура ВидыДеятельностиПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.ВидыДеятельности.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		//++ #Б-7322 смарт: Фролов 06.07.2026 //Справочник "Партнеры". Таблица "Виды деятельности". Добавить реквизиты.
		//Элементы.ДругоеРасшифровкаВидаДеятельности.Видимость = ТекущиеДанные.Значение = ВидДеятельностиДругое И ТекущиеДанные.Пометка;
		Элементы.ДругоеРасшифровкаВидаДеятельности.Видимость = ТекущиеДанные.ВидДеятельности = ВидДеятельностиДругое И ТекущиеДанные.Пометка;
		Элементы.ДекорацияОбоснованиеВыбораИИ.Заголовок = ТекущиеДанные.ОбоснованиеВыбораИИ;
		Элементы.ДекорацияЗаголовокОбоснованиеВыбораИИ.Видимость = СтрДлина(ТекущиеДанные.ОбоснованиеВыбораИИ) > 0;
		Элементы.ДекорацияОбоснованиеВыбораИИ.Видимость = СтрДлина(ТекущиеДанные.ОбоснованиеВыбораИИ) > 0;
		//-- #Б-7322 смарт: Фролов 06.07.2026
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ТипичноеОборудованиеПриАктивизацииСтроки(Элемент)
	ТекущиеДанные = Элементы.ТипичноеОборудование.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		Элементы.ДругоеРасшифровкаТипичногоОборудования.Видимость = ТекущиеДанные.ТипичноеОборудование = ТипичноеОборудованиеДругое И ТекущиеДанные.Пометка;		
	КонецЕсли;
КонецПроцедуры

//-- #6764 смарт: Тимофеева 15.05.2026 


&НаКлиенте
//++ #Б-7322 смарт: Фролов 06.07.2026 //Справочник "Партнеры". Таблица "Виды деятельности". Добавить реквизиты.
Процедура ВидыДеятельностиПередНачаломИзменения(Элемент, Отказ)
	
	ТекущиеДанные = Элементы.ВидыДеятельности.ТекущиеДанные;
	Если ТекущиеДанные.УстановленИИ И ТекущиеДанные.Пометка Тогда
		Отказ = Истина;
		Возврат;
	Иначе
		ТекущиеДанные.УстановленМенеджером = ТекущиеДанные.Пометка;
	КонецЕсли;	
	
КонецПроцедуры //-- #Б-7322 смарт: Фролов 06.07.2026
